"""
Задача №1.
Дано n чисел. Перше число на вході n, після чого задано n цілих чисел.
Необхідно порахувати кількість нулів серед введених користувачем чисел.


Автор: Жулід А А
"""
n = int(input("Введіть кількість чисел: "))
nuli = 0
for i in range(n):
    num = int(input("Введіть число: "))
    if num == 0:
        nuli = nuli + 1
print(nuli)
