"""
Задача №2.
Оленка вчиться ділити з залишком. Вона взяла деяке число, розділила його
на 2 і відкинула залишок. Те, що вийшло, розділила на 3 та знову відкинула
залишок. Отримане число вона розділила на 4, відкинула залишок і отримала
число k. Яке число могла вибрати Оленка спочатку? Вводиться натуральне
число k, що не перевершує 1000. Необхідно вивести усі можливі числа, які
могла б вибрати спочатку Оленка, за зростанням, розділяючи їх пропусками.


Автор: Жулід А А
"""
num = int(input("Введіть число k: "))
chisla = []
for x in range(1, 1001):
    dil1 = x // 2
    dil2 = dil1 // 3
    dil3 = dil2 // 4
    if dil3 == num:
        chisla.append(x)
print("Можливі числа для Оленки: ")
for n in chisla:
    print(n, end=" ")

